AXKuhta/stm32_ad9910/uart_cli.c
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

#include "stm32f7xx_hal.h"

#include "freertos_extras/allocator.h"
#include "isr.h"
#include "performance.h"
#include "ad9910.h"
#include "state.h"
#include "units.h"
#include "timer.h"
#include "timer/emulator.h"
#include "sequencer.h"
#include "algos.h"
#include "json.h"
#include "vec.h"

extern uint32_t ad_system_clock;

#define ABS(x) (x < 0 ? -x : x)

// Подготовка кодов для регистров CCMR
// TODO: вынести в другое место
#define DR_CTL	  0b00000001
#define DRHOLD    0b00000010
#define TXE       0b00000100
#define OSK       0b00001000
#define P_0       0b00010000
#define P_1       0b00100000
#define P_2       0b01000000
#define IO_UPDATE 0b10000000

#define PROFILE0  (0)
#define PROFILE1  (P_0)
#define PROFILE2  (P_1)
#define PROFILE3  (P_1 | P_0)
#define PROFILE4  (P_2)
#define PROFILE5  (P_2 | P_0)
#define PROFILE6  (P_2 | P_1)
#define PROFILE7  (P_2 | P_1 | P_0)

typedef struct logic_t {
	uint64_t hold_ns;
	uint8_t state;
} logic_t;

// Терминатор должен быть именно такой
// Первый элемент - парковочный профиль
// Второй элемент - оттянуть момент NDTR == 0 до конца излучения
// Третий элемент - терминатор
#define TERMINATOR 	{ .hold_ns = 10*1000, .state = 0 }, \
					{ .hold_ns = 10*1000, .state = 0 }, \
					{ 0, 0 }

// Спуск последовательности состояний в машинные коды
// Выделит и вернёт три массива для DMA
//
// Пример использования:
//
// ```
// seq_entry_t pulse = {
//     .logic_level_sequence = lower_logic_sequence((logic_t[]){
//         { .hold_ns = 900*1000, .state = P_0 }, // Излучение
//         TERMINATOR // Парковка + терминатор
//     })
// };
// ```
//
// Мелкое замечание: истинная длительность излучения будет прыгать в пределах
// 4 нс, т.к. спад сигналов профилей прыгает между соседними тактами AD9910
//
static logic_level_sequence_t lower_logic_sequence(logic_t states[]) {
	const uint32_t timer_mhz = HAL_RCC_GetSysClockFreq() / 1000 / 1000;
	uint64_t min_timer_mu = 0;
	size_t state_count = 0;

	// Проход 1: примерить каждый чип на минимальный квант таймера
	// Также определяем истинный квант времени последовательности
	for (size_t i = 0; states[i].hold_ns; i++) {
		uint64_t timer_mu = states[i].hold_ns * timer_mhz / 1000;

		// Не можем точно представить время?
		// TODO: сообщение об ошибке
		assert(states[i].hold_ns * timer_mhz % 1000 == 0);
		assert(timer_mu > 0);

		if (state_count == 0 || timer_mu < min_timer_mu)
			min_timer_mu = timer_mu;

		state_count++;
	}

	assert(state_count > 0);

	// Подобрать максимально грубый квант таймера, который точно делит ВСЕ длительности
	// Начинаем искать с наигрубейшего возможного
	uint32_t divider_cap = min_timer_mu < 65536 ? min_timer_mu : 65536;
	uint32_t divider = 1;

	assert(divider_cap >= 1);

	for (uint32_t trial = divider_cap; trial > 0; trial--) {
		int ok = 1;

		for (size_t i = 0; states[i].hold_ns; i++) {
			uint64_t timer_mu = states[i].hold_ns * timer_mhz / 1000;

			if (timer_mu % trial) {
				ok = 0;
				break;
			}
		}

		if (ok) {
			divider = trial;
			break;
		}
	}

	assert(divider > 0);

	// Проход 2: определить необходимый запас слотов времени
	size_t slots_used = 0;

	for (size_t i = 0; states[i].hold_ns; i++) {
		uint64_t timer_mu = (states[i].hold_ns * timer_mhz) / 1000;
		uint64_t timer_ticks = timer_mu / divider;
		size_t slots = (timer_ticks + 0xFFFF - 1) / 0xFFFF;

		slots_used += slots;
	}

	assert(slots_used > 0);
	assert(slots_used <= 0x7FFF); // Ограничение DataLength у HAL_TIM_DMABurst_MultiWriteStart (2 * count <= 0xFFFF)

	// TODO: использовать uint16_t - верхние биты бесполезны
	uint32_t* slave_a_stream = malloc(2 * sizeof(uint32_t) * slots_used);
	uint32_t* slave_b_stream = malloc(2 * sizeof(uint32_t) * slots_used);
	uint16_t* hold_time = malloc(sizeof(uint16_t) * slots_used);

	assert(slave_a_stream != NULL);
	assert(slave_b_stream != NULL);
	assert(hold_time != NULL);

	// см. "Output compare 1 mode"
	// https://www.st.com/resource/en/reference_manual/rm0385-stm32f75xxx-and-stm32f74xxx-advanced-armbased-32bit-mcus-stmicroelectronics.pdf
	const uint8_t set_hi = 0b00010000;
	const uint8_t set_lo = 0b00100000;

	// Проход 3: делаем машинные коды
	for (size_t i = 0, j = 0; states[i].hold_ns; i++) {
		uint8_t state = states[i].state;

		uint8_t a1 = state & DR_CTL ? set_hi : set_lo;		// PC6
		uint8_t a2 = state & DRHOLD ? set_hi : set_lo;		// PC7
		uint8_t a3 = state & TXE    ? set_hi : set_lo;		// PC8
		uint8_t a4 = state & OSK    ? set_hi : set_lo;		// PC9
		uint8_t b1 = state & P_1    ? set_hi : set_lo;		// PD12
		uint8_t b2 = state & P_0    ? set_hi : set_lo;		// PD13
		uint8_t b3 = state & P_2    ? set_hi : set_lo;		// PD14
		uint8_t b4 = state & IO_UPDATE ? set_hi : set_lo;	// PD15

		uint64_t timer_mu = states[i].hold_ns * timer_mhz / 1000;
		uint64_t remain_ticks = timer_mu / divider;

		while (remain_ticks > 0) {
			uint16_t slot_ticks = remain_ticks > 0xFFFF ? 0xFFFF : remain_ticks;

			slave_a_stream[2*j + 0] = (a2 << 8) + a1;
			slave_a_stream[2*j + 1] = (a4 << 8) + a3;

			slave_b_stream[2*j + 0] = (b2 << 8) + b1;
			slave_b_stream[2*j + 1] = (b4 << 8) + b3;

			hold_time[j] = slot_ticks;

			remain_ticks -= slot_ticks;
			j++;
		}
	}

	return (logic_level_sequence_t) {
		.slave_a_stream = (void*)slave_a_stream,
		.slave_b_stream = (void*)slave_b_stream,
		.hold_time = hold_time,
		.count = slots_used,
		.prescaler = divider - 1
	};
}

// =============================================================================
// CLI COMMANDS
// =============================================================================

// 10^(-.4 dBm/10)		matches PR100 (158 MHz tone)
// #define OUTPUT_RATIO_CAL 0.9120108394

// 10^(-.2 dBm/10)		should match G4-218 (158 MHz tone)
#define OUTPUT_RATIO_CAL 1.0

void set_level_cmd(const char* str) {
	char unit[4] = {0};
	double voltage;

