AXKuhta/stm32_ad9910/uart_cli.c
	int rc = sscanf(str, "%*s %lf %3s", &voltage, unit);

	if (rc != 2) {
		printf("Invalid arguments\n");
		printf("Usage: set_level voltage unit\n");
		printf("Example: set_level 200 mV\n");
		return;
	}

	double voltage_vrms = parse_volts(voltage, unit);

	if (voltage_vrms == 0) {
		return;
	}

	uint16_t asf;
	uint8_t fsc;

	int success = best_asf_fsc(voltage_vrms / OUTPUT_RATIO_CAL, &asf, &fsc);

	if (!success) {
		printf("Unable; try a voltage below 270 mV\n");
		return;
	}

	if (asf < 2) {
		printf("Unable; try a voltage above 10 uV\n");
		return;
	}

	double backconv_voltage = ad_vrms(asf, fsc) * OUTPUT_RATIO_CAL;

	// Assume 50 ohms load
	double watts = backconv_voltage * backconv_voltage / 50.0;
	double dbm = 10.0*log10(watts / .001);

	char* verif_voltage = volts_unit( backconv_voltage );

	state.asf = asf;
	state.fsc = fsc;

	printf("Set ASF=%u FSC=%u which is %s rms or %.1lf dBm\n", asf, fsc, verif_voltage, dbm);

	free(verif_voltage);
}

void dbg_level_cmd(const char* str) {
	uint16_t asf;
	uint8_t fsc;

	int rc = sscanf(str, "%*s %hu %hhu", &asf, &fsc);

	if (rc != 2) {
		printf("Invalid arguments\n");
		printf("Usage: dbg_level asf fsc\n");
		printf("Example: dbg_level 16383 127\n");
		return;
	}

	double backconv_voltage = ad_vrms(asf, fsc) * OUTPUT_RATIO_CAL;

	// Assume 50 ohms load
	double watts = backconv_voltage * backconv_voltage / 50.0;
	double dbm = 10.0*log10(watts / .001);

	char* verif_voltage = volts_unit( backconv_voltage );

	printf("Set ASF=%u FSC=%u which is %s rms or %.1lf dBm\n", asf, fsc, verif_voltage, dbm);

	state.asf = asf;
	state.fsc = fsc;

	free(verif_voltage);
}

void test_tone_cmd(const char* str) {
	char unit[4] = {0};
	double freq;

	int rc = sscanf(str, "%*s %lf %3s", &freq, unit);

	if (rc != 2) {
		printf("Invalid arguments\n");
		printf("Usage: test_tone freq unit\n");
		printf("Example: test_tone 150 MHz\n");
		return;
	}

	uint32_t freq_hz = parse_freq(freq, unit);

	if (freq_hz == 0) {
		return;
	}

	char* verif_freq = freq_unit(freq_hz);

	printf("Test tone at %s\n", verif_freq);

	free(verif_freq);

	enter_test_tone_mode(freq_hz);
}

void basic_pulse_cmd(const char* str) {
	char o_unit[4] = {0};
	char d_unit[4] = {0};
	char f_unit[4] = {0};
	double offset;
	double duration;
	double freq;

	int rc = sscanf(str, "%*s %lf %3s %lf %3s %lf %3s", &offset, o_unit, &duration, d_unit, &freq, f_unit);

	if (rc != 6) {
		printf("Invalid arguments\n");
		printf("Usage: basic_pulse delay unit duration unit freq unit\n");
		printf("Example: basic_pulse 100 us 250 us 150 MHz\n");
		return;
	}

	uint32_t freq_hz = parse_freq(freq, f_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t duration_ns = parse_time(duration, d_unit);

	if (freq_hz == 0) {
		return;
	}

	char* verif_freq = freq_unit(freq_hz);
	char* verif_t1 = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_t2 = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Basic pulse at %s, offset %s, duration %s\n", verif_freq, verif_t1, verif_t2);

	free(verif_freq);
	free(verif_t1);
	free(verif_t2);

	uint16_t rate = fit_time(duration_ns);

	if (rate == 0)
		return;

	uint16_t element_count = (duration_ns / 4) / rate;

	uint8_t* ram = malloc(4*element_count + 4);

	for (size_t i = 0; i < element_count; i++) {
		ram[4*i + 0] = 0x00;
		ram[4*i + 1] = 0x00;
		ram[4*i + 2] = (state.asf >> 6);
		ram[4*i + 3] = (state.asf << 2) & 0xFF;
	}

	memset(ram + element_count*4, 0, 4);

	seq_entry_t pulse = {
		.fsc = state.fsc,
		.ram_profiles[0] = {
			.start = element_count,
			.end = element_count,
			.rate = 0,
			.mode = AD_RAM_PROFILE_MODE_DIRECTSWITCH
		},
		.ram_profiles[1] = {
			.start = 0,
			.end = element_count,
			.rate = rate,
			.mode = AD_RAM_PROFILE_MODE_RAMPUP
		},
		.ram_image = { .buffer = (uint32_t*)ram, .size = element_count + 1 },
		.ram_destination = AD_RAM_DESTINATION_POLAR,
		.ram_secondary_params = { .ftw =  ad_calc_ftw(freq_hz) },
		.logic_level_sequence = lower_logic_sequence(
			offset_ns ? (logic_t[]){
				{ .hold_ns = offset_ns, .state = 0 },
				{ .hold_ns = duration_ns, .state = PROFILE1 },
				TERMINATOR
			} : (logic_t[]){
				{ .hold_ns = duration_ns, .state = PROFILE1 },
				TERMINATOR
			}
		)
	};

	sequencer_reset();
	sequencer_add(pulse);
	sequencer_run();
}

static void sequencer_add_sweep_internal(const char* str, const char* fstr, const char* caller, int run) {
	char o_unit[4] = {0};
	char d_unit[4] = {0};
	char fc_unit[4] = {0};
	double offset;
	double duration;
	double fc;
	int a;
	int b;

	int rc = sscanf(str, fstr, &offset, o_unit, &duration, d_unit, &fc, fc_unit, &a, &b);

	if (rc != 8) {
		printf("Invalid arguments\n");
		printf("Usage: %s delay unit duration unit center_freq unit a b\n", caller);
		printf("Sweep width is determined by: (duration / 4 ns) * (1 GHz / 2^32) * (a/b)\n");
		printf("When a is positive, sweep goes from fc - width/2 to fc + width/2\n");
		printf("When a is negative, sweep goes from fc + width/2 to fc - width/2\n");
		printf("Example: %s 100 us 250 us 140 MHz 1 1\n", caller);
		return;
	}

	uint32_t fc_hz = parse_freq(fc, fc_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint64_t duration_ns = parse_time(duration, d_unit);

	if (b < 1) {
		printf("Invalid b; must be greater than 0\n");
		return;
	}

	// FIXME: Assuming 1 GHz ad_system_clock
	double fstep = ad_system_clock / ((1ull << 32) + 0.0);
	uint32_t steps = duration_ns / (4ULL * b);

	if (duration_ns % (4 * b) != 0) {
		printf("Invalid combination of duration and b; duration must be a factor of b * 4 ns\n");
		return;
	}

	double span_hz = a * fstep * (steps - 1);
	double f1_hz = fc_hz - span_hz/2;
	double f2_hz = f1_hz + span_hz;

	char* verif_f1 = freq_unit(f1_hz);
	char* verif_f2 = freq_unit(f2_hz);
	char* verif_fc = freq_unit(fc_hz);
	char* verif_span = freq_unit( ABS(span_hz) );
	char* verif_offset = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

