AXKuhta/stm32_ad9910/uart_cli.c
	int rc = sscanf(str, "%*s %*s %lf %3s %lf %3s %lf %3s", &offset, o_unit, &duration, d_unit, &freq, f_unit);

	if (rc != 6) {
		printf("Invalid arguments\n");
		printf("Usage: seq pulse delay unit duration unit freq unit\n");
		printf("Example: seq pulse 100 us 250 us 150 MHz\n");
		return;
	}

	uint32_t freq_hz 		= parse_freq(freq, f_unit);
	uint32_t offset_ns 		= parse_time(offset, o_unit);
	uint32_t duration_ns 	= parse_time(duration, d_unit);

	if (freq_hz == 0) {
		return;
	}

	char* verif_freq 		= freq_unit(freq_hz);
	char* verif_offset 		= time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration 	= time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Sequence basic pulse at %s, offset %s, duration %s\n", verif_freq, verif_offset, verif_duration);

	seq_entry_t pulse = {
		.fsc = state.fsc,
		.profiles[0] = { .ftw = 0, .asf = 0 },
		.profiles[1] = { .ftw = ad_calc_ftw(freq_hz), .asf = state.asf },
		.logic_level_sequence = lower_logic_sequence(
			offset_ns ? (logic_t[]){
				{ .hold_ns = offset_ns, .state = 0 },
				{ .hold_ns = duration_ns, .state = PROFILE1 },
				TERMINATOR
			} : (logic_t[]){
				{ .hold_ns = duration_ns, .state = PROFILE1 },
				TERMINATOR
			}
		)
	};

	sequencer_add(pulse);

	free(verif_freq);
	free(verif_offset);
	free(verif_duration);
}

static void _json_load_ram_profiles(const char* json, seq_entry_t* pulse) {
	int offset = json_query_location( json, (const char* []){"v2", "ram_profiles", NULL} );

	assert(offset != - 1);

	int count = json_query_count( json+offset, (const char* []){NULL} );

	assert(count > 0);
	assert(count < 8);

	for (int i = 0; i < count; i++) {
		const char idx[2] = {'0' + i, 0};

		pulse->ram_profiles[i] = (ram_profile_t) {
			.start = json_query_i32(json+offset, (const char* []){idx, "start", NULL} ),
			.end = json_query_i32(json+offset, (const char* []){idx, "end", NULL} ),
			.mode = json_query_i32(json+offset, (const char* []){idx, "mode", NULL} ),
			.rate = json_query_i32(json+offset, (const char* []){idx, "rate", NULL} )
		};
	}
}

static void _json_load_tone_profiles(const char* json, seq_entry_t* pulse) {
	int offset = json_query_location( json, (const char* []){"v2", "profiles", NULL} );

	assert(offset != -1);

	int count = json_query_count( json+offset, (const char* []){NULL} );

	assert(count > 0);
	assert(count <= 8);

	for (int i = 0; i < count; i++) {
		const char idx[2] = {'0' + i, 0};

		pulse->profiles[i] = (profile_t) {
			.asf = json_query_i32(json+offset, (const char* []){idx, "asf", NULL} ),
			.ftw = json_query_i32(json+offset, (const char* []){idx, "ftw", NULL} ),
			.pow = json_query_i32(json+offset, (const char* []){idx, "pow", NULL} )
		};
	}
}

static void _json_load_logic_level_sequence(const char* json, seq_entry_t* pulse) {
	int offset = json_query_location( json, (const char* []) {"v2", "logic_level_sequence", NULL} );

	assert(offset != -1);

	int count = json_query_count( json+offset, (const char* []){NULL} );

	assert(count > 0);
	assert(count < 16383 - 2);

	vec_t(logic_t)* vec = init_vec(logic_t);

	for (int i = 0; i < count; i++) {
		char idx[6] = {0};

		sprintf(idx, "%d", i);

		vec_push(vec, (logic_t){
			.hold_ns = json_query_i32(json+offset, (const char* []){idx, "hold_ns", NULL} ),
			.state = json_query_i32(json+offset, (const char* []){idx, "state", NULL} )
		});
	}

	// FIXME: Нужно обновить терминатор в других местах с vec_push
	vec_push(vec, (logic_t){ .hold_ns = 1*1000, .state = 0 } );
	vec_push(vec, (logic_t){ .hold_ns = 1*1000, .state = 0 } );
	vec_push(vec, (logic_t){ 0 });

	pulse->logic_level_sequence = lower_logic_sequence(vec->elements);

	free_vec(vec);
}

void sequencer_add_json_cmd(const char* str) {
	const char* json = str + 8;

	int ram = json_query_count( json, (const char* []) {"v2", "ram", NULL} );

	seq_entry_t pulse = {
		.fsc = state.fsc
	};

	if (ram > 0) {
		_json_load_ram_profiles(json, &pulse);
	} else {
		_json_load_tone_profiles(json, &pulse);
	}

	_json_load_logic_level_sequence(json, &pulse);

	sequencer_add(pulse);
}

void sequencer_cmd(const char* str) {
	char cmd[32] = {0};

	int rc = sscanf(str, "%*s %31s", cmd);

	if (rc != 1) {
		printf("Invalid arguments\n");
		printf("Usage: seq reset\n");
		printf("Usage: seq show\n");
		printf("Usage: seq pulse ...\n");
		printf("Usage: seq sweep ...\n");
		printf("Usage: seq json ...\n");
		printf("Usage: seq run\n");
		printf("Usage: seq stop\n");
		return;
	}

	if (strcmp(cmd, "reset") == 0) return sequencer_reset();
	if (strcmp(cmd, "show") == 0) return sequencer_show();
	if (strcmp(cmd, "pulse") == 0) return sequencer_add_pulse_cmd(str);
	if (strcmp(cmd, "sweep") == 0) return sequencer_add_sweep_cmd(str);
	if (strcmp(cmd, "json") == 0) return sequencer_add_json_cmd(str);
	if (strcmp(cmd, "run") == 0) return sequencer_run();
	if (strcmp(cmd, "stop") == 0) return sequencer_stop();

	printf("Unknown sequencer command: [%s]\n", cmd);
}

void radar_emulator_cmd(const char* str) {
	char d_unit[4] = {0};
	char f_unit[4] = {0};
	double duration;
	double freq;
	int limit;

	int rc = sscanf(str, "%*s %lf %s %lf %s %d", &freq, f_unit, &duration, d_unit, &limit);

	if (rc != 4 && rc != 5) {
		printf("Invalid arguments\n");
		printf("Usage: radar_emulator freq unit duration unit [count]\n");
		printf("Example - infinite pulses: radar_emulator 25 Hz 12 us\n");
		printf("Example - just one pulse: radar_emulator 25 Hz 12 us 1\n");
		return;
	}

	if (rc == 4) {
		limit = 0;
	} else {
		if (!limit) {
			radar_emulator_stop();
			return;
		}

		if (limit > 65535) {
			printf("Pulse count must be no greater than 65535\n");
			return;
		}
	}

	if (freq == 0.0 || duration == 0.0) {
		radar_emulator_stop();
		return;
	}

	double freq_hz = parse_freq(freq, f_unit);
	double duration_ns = parse_time(duration, d_unit);

