AXKuhta/stm32_ad9910/uart_cli.c
	radar_emulator_start(freq_hz, duration_ns / 1000.0 / 1000.0 / 1000.0, limit);
}

void trig_cmd(const char* str) {
	char mode[5] = {0};

	int rc = sscanf(str, "%*s %4s", mode);

	if (rc != 1) {
		printf("Invalid arguments\n");
		printf("Usage: trig mode\n");
		printf("Modes are: rise, fall\n");
		return;
	}

	if (strcmp(mode, "rise") == 0) {
		state.trigger = TRIG_RISE;
		printf("Trigger set to rising\n");
	} else if (strcmp(mode, "fall") == 0) {
		state.trigger = TRIG_FALL;
		printf("Trigger set to falling\n");
	} else {
		printf("Invalid mode; valid are: rise, fall\n");
	}
}

#include "FreeRTOS.h"
#include "queue.h"

#include "events.h"
#include "ack.h"

// Режим следования за DDC
// Получение UDP пакетов было вынесено в ack.c внутрь демона событий DDC
//
// Принцип действия:
// - [РАНЬШЕ] Запуск при первом пакете от DDC, остановка при остутствии пакетов в течение 1000 мс
// - [СЕЙЧАС] Запуск при первом пакете, остановка если два непризнанных триггера - или если нет событий в течение 1000 мс
//
// Любой пакет (пакетов за раз много) от DDC считается признанием всех триггеров
//
void wait_mcast_packet() {
	uint32_t triggers_unacknowledged = 99;
	event_t evt;

	extern QueueHandle_t event_queue;

	// Опустошить очередь
	xQueueReset(event_queue);

	// Ждём первый Acknowledgement
	do {
		int rc = printf("Waiting...\n");

		if (rc < 0) // Не можем отправить "waiting"? значит TCP клиент разорвал сессию
			return;

		while (xQueueReceive(event_queue, &evt, 1000) == pdPASS) {
			if (evt.origin == DDC_ACK_EVENT) {
				triggers_unacknowledged = 0;
				break; // Чтобы не застрять - события пойдут плотным потоком
			}
		}
	} while (triggers_unacknowledged);

	// Повторно опустошить
	xQueueReset(event_queue);

	// Запуск
	sequencer_run();

	printf("Running\n");

	// Разбираем события
	while (xQueueReceive(event_queue, &evt, 1000) == pdPASS) {
		int rc = 0;

		switch (evt.origin) {
			case TRIGGER_EVENT:
				rc = printf("%llu\tTRIG\n", evt.timestamp);
				triggers_unacknowledged++;
				break;
			case READY_EVENT:
				rc = printf("%llu\tREADY\n", evt.timestamp);
				break;
			case DDC_ACK_EVENT:
				if (triggers_unacknowledged)
					rc = printf("%llu\tDDC ACK\n", evt.timestamp);
				triggers_unacknowledged = 0;
				break;
		
			default:
				assert(0);
		}

		if (triggers_unacknowledged >= 2)
			break;

		if (rc < 0)
			break;
	}

	// Здесь делаем сброс чтобы противодействовать фрагментации
	sequencer_reset();

	printf("Stop\n");
}

void run(const char* str) {
	char cmd[32] = {0};

	int rc = sscanf(str, "%31s", cmd);

	if (rc == 0) {
		printf("Invalid str\n");
		return;
	}

	if (strcmp(cmd, "isr") == 0) return print_it();
	if (strcmp(cmd, "mem") == 0) return print_mem();
	if (strcmp(cmd, "seq") == 0) return sequencer_cmd(str);
	if (strcmp(cmd, "perf") == 0) return print_perf();
	if (strcmp(cmd, "write") == 0) return ad_write_all();
	if (strcmp(cmd, "verify") == 0) return ad_readback_all();
	if (strcmp(cmd, "ram_test") == 0) return ad_ram_test();
	if (strcmp(cmd, "rfkill") == 0) return enter_rfkill_mode();
	if (strcmp(cmd, "set_level") == 0) return set_level_cmd(str);
	if (strcmp(cmd, "dbg_level") == 0) return dbg_level_cmd(str);
	if (strcmp(cmd, "test_tone") == 0) return test_tone_cmd(str);
	if (strcmp(cmd, "basic_pulse") == 0) return basic_pulse_cmd(str);
	if (strcmp(cmd, "basic_sweep") == 0) return basic_sweep_cmd(str);
	if (strcmp(cmd, "basic_xmitdata") == 0) return basic_xmitdata_cmd(str);
	if (strcmp(cmd, "radar_emulator") == 0) return radar_emulator_cmd(str);
	if (strcmp(cmd, "wait") == 0) return wait_mcast_packet();
	if (strcmp(cmd, "trig") == 0) return trig_cmd(str);
	if (strcmp(cmd, "reboot") == 0) return NVIC_SystemReset();

	printf("Unknown command: [%s]\n", cmd);
}
